<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PostSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('posts')->insert([
            'title' => 'ما هو الذكاء الاصطناعي؟',
            'slug' => '1-ما-هو-الذكاء-الاصطناعي؟',
            'body' => '<p>ّف منظمــة التعــاون والتنميــة االقتصاديــة الــذكاء تُعــر االصطناعــي عــى أنــه »الــذكاء الــذي تبديــه اآلالت والربامـج بهـدف وضـع التوقعـات وتقديـم االقرتاحـات أو اتخــاذ القــرارات التــي توثــر عــى العــامل الحقيقــي أو االفــرايض ملجموعــة مــن البــر أو األشــياء.« ّ الــذكاء االصطناعــي بتطــورات عديــدة منــذ بداياتــه مــر عندمــا ابتكــر عــامل الكمبيوتــر األمريــي جــون مــكاريث مصطلــح »الــذكاء االصطناعــي« للمــرة األوىل يف أحــد املؤمتــرات العلميــة يف جامعــة دارمتــوث يف عــام 1956 والتــي أجمــع فيهــا الحضــور عــى أن الــذكاء االصطناعــي يتعلــق بصناعــة اآلالت التــي تشــبه يف ّع خــال رحلــة تطــوره ذكائهــا عقــل اإلنســان، وتفــر إىل أنــواع عديــدة منهــا الــذكاء االصطناعــي العــام، املتخصــص بــأداء أي مهــام برشيــة أو جســدية أو عاطفيــة، والــذكاء االصطناعــي املحــدود، ويقصــد بــه مجموعـة األنظمـة التـي ميكنهـا التعامـل مـع مجموعـة محــدودة مــن املهــام مثــل طريقــة عمــل ترجمــة جوجــل وتطبيــق ســري، والــذكاء االصطناعــي الفائــق، والــذي يشــمل التقنيــات املــزودة بقــدرات إدراكيــة تفــوق الــذكاء البــري. وحديثــاً ظهــرت ثــورة الــذكاء االصطناعــي التوليــدي التــي شــهدت إقبــاالً عامليــاً</p>',
            'user_id' => 3,
            'approved' => true,
            'category_id' => 1,
            'created_at' => '2022-05-05 05:08:00',
            'image_path' => 'politica.png',
        ]);
        DB::table('posts')->insert([
            'title' => 'ما هو الذكاء االصطناعي التوليدي؟',
            'slug' => '1-ما-هو-الذكاء-االصطناعي-التوليدي؟',
            'body' => '<p>ميثــل الــذكاء االصطناعــي التوليــدي أحــدث تقنيــات الــذكاء االصطناعــي وأكرثهــا تطــوراً وانتشــارا،ً وهــو نــوع مــن تقنيــات التعلــم اآليل التــي متتلــك القــدرة عــى إنشــاء بيانــات جديــدة، مثــل الصــور والنصــوص ً واملقاطــع الصوتيــة، بنــاء عــى تدريــب اإلنســان لهــذه التقنيــات، كــا ميكــن اســتخدام الــذكاء االصطناعــي التوليــدي يف ابتــكار املســاعد االفــرايض للمحادثــات اإللكرتونيـة وخدمـة املتعاملـن، أو إنشـاء املوسـيقى واملحتــوى الفنــي ألهــداف تســويقية أو إبداعيــة وغريهــا. تعتــر شــبكات الخصومــة التوليديــة )GANs )أشــهر أنــواع الــذكاء االصطناعــي التوليــدي التــي ابتكرهــا إيــان جودفيلــو وتتكــون مــن منوذجــن مــن الشــبكات العصبيــة االصطناعيــة: الشــبكة التوليديــة والشــبكة التمييزيــة، حيــث تنشــئ الشــبكة التوليديــة البيانــات الجديــدة، بينــا تحــاول الشــبكة التمييزيــة مقارنــة البيانــات الجديــدة بالبيانــات الحقيقيــة. ونظــراً لتدريــب هاتــن الشــبكتني معــا،ً تتعلــم الشــبكة التوليديــة إنشــاء بيانــات ال ميكــن للشــبكة التمييزيــة متييزهــا عـن البيانـات الحقيقيـة وإنشـاء صـور ومقاطـع فيديـو عاليـة الجـودة مـا يجعلهـا مختلفـة عـن النـاذج األخـرى.</p>',
            'user_id' => 3,
            'approved' => true,
            'category_id' => 2,
            'created_at' => '2022-05-05 05:08:00',
            'image_path' => 'politica.png',
        ]);
        DB::table('posts')->insert([
            'title' => 'أهمية املحافظة عىل خصوصية البيانات',
            'slug' => '1-أهمية-املحافظة-عىل-خصوصية-البيانات',
            'body' => '<p>يشــر مصطلــح املحافظــة عــى خصوصيــة البيانــات إىل حاميــة البيانــات الشــخصية مــن مــن أي طــرف ال يجــوز لــه االطــاع عليهــا وقــدرة األفــراد عــى تحديــد مــن ميكنــه الوصــول إىل معلوماتهــم الشــخصية. وتعتـر املحافظـة عـى خصوصيـة البيانـات الشـخصية مفهومــاً حضاريــاً ومطلبــاً أساســياً لحاميــة الحقــوق واحــرام الخصوصيــة وتعزيــز الثقــة. ونظــراً ألن الــذكاء االصطناعــي التوليــدي قائــم عــى البيانــات التــي يدخلهــا املســتخدمون، ينبغــي عليهــم الحفــاظ عــى خصوصيتهــم يف جميــع األوقــات، وتجنــب إدخــال معلومــات شــخصية أو رسيــة مثــل العنــوان أو معلومــات الهويــة الشــخصية أو البيانــات املاليـة ألن ذلـك مـن شـأنه أن يـؤدي إىل الكشـف عـن معلومــات حساســة مثــل أرقــام الضــان االجتامعــي وأرقــام بطاقــات االئتــان واملعلومــات املتعلقــة</p>',
            'user_id' => 3,
            'approved' => true,
            'category_id' => 3,
            'created_at' => '2022-05-05 05:08:00',
            'image_path' => 'politica.png',
        ]);
        DB::table('posts')->insert([
            'title' => 'خصوصية البيانات',
            'slug' => '1-خصوصية-البيانات',
            'body' => '<p>يشــر مصطلــح املحافظــة عــى خصوصيــة البيانــات إىل حاميــة البيانــات الشــخصية مــن مــن أي طــرف ال يجــوز لــه االطــاع عليهــا وقــدرة األفــراد عــى تحديــد مــن ميكنــه الوصــول إىل معلوماتهــم الشــخصية. وتعتـر املحافظـة عـى خصوصيـة البيانـات الشـخصية مفهومــاً حضاريــاً ومطلبــاً أساســياً لحاميــة الحقــوق واحــرام الخصوصيــة وتعزيــز الثقــة. ونظــراً ألن الــذكاء االصطناعــي التوليــدي قائــم عــى البيانــات التــي يدخلهــا املســتخدمون، ينبغــي عليهــم الحفــاظ عــى خصوصيتهــم يف جميــع األوقــات، وتجنــب إدخــال معلومــات شــخصية أو رسيــة مثــل العنــوان أو معلومــات الهويــة الشــخصية أو البيانــات املاليـة ألن ذلـك مـن شـأنه أن يـؤدي إىل الكشـف عـن معلومــات حساســة مثــل أرقــام واملعلومــات املتعلقــة</p>',
            'user_id' => 3,
            'approved' => true,
            'category_id' => 4,
            'created_at' => '2022-05-05 05:08:00',
            'image_path' => 'politica.png',
        ]);
    }
}
